## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-   destroy

Terraform will perform the following actions:

  # kubernetes_annotations.cinema will be destroyed
  # (because kubernetes_annotations.cinema is not in configuration)
-   resource "kubernetes_annotations" "cinema" {
-       annotations = {
-           "mesh.cloud.google.com/proxy" = jsonencode(
                {
-                   managed = "true"
                }
            )
        } -> null
-       api_version = "v1" -> null
-       id          = "apiVersion=v1,kind=Namespace,name=cinema" -> null
-       kind        = "Namespace" -> null

-       metadata {
-           name = "cinema" -> null
        }
    }

  # kubernetes_labels.default-istio will be destroyed
  # (because kubernetes_labels.default-istio is not in configuration)
-   resource "kubernetes_labels" "default-istio" {
-       api_version = "v1" -> null
-       id          = "apiVersion=v1,kind=Namespace,name=default" -> null
-       kind        = "Namespace" -> null
-       labels      = {
-           "istio.io/rev" = "asm-managed-regular"
        } -> null

-       metadata {
-           name = "default" -> null
        }
    }

  # kubernetes_namespace.cinema will be updated in-place
!   resource "kubernetes_namespace" "cinema" {
        id = "cinema"

!       metadata {
!           annotations      = {
-               "mesh.cloud.google.com/proxy" = jsonencode(
                    {
-                       managed = "true"
                    }
                ) -> null
            }
            name             = "cinema"
            # (4 unchanged attributes hidden)
        }
    }

  # kubernetes_namespace.istio-egress will be destroyed
  # (because kubernetes_namespace.istio-egress is not in configuration)
-   resource "kubernetes_namespace" "istio-egress" {
-       id = "istio-egress" -> null

-       metadata {
-           annotations      = {} -> null
-           generation       = 0 -> null
-           labels           = {
-               "istio-injection" = "enabled"
            } -> null
-           name             = "istio-egress" -> null
-           resource_version = "39222" -> null
-           uid              = "9ef25812-7c49-4d2f-b41d-441322318b7d" -> null
        }
    }

  # kubernetes_namespace.istio-ingress will be destroyed
  # (because kubernetes_namespace.istio-ingress is not in configuration)
-   resource "kubernetes_namespace" "istio-ingress" {
-       id = "istio-ingress" -> null

-       metadata {
-           annotations      = {} -> null
-           generation       = 0 -> null
-           labels           = {
-               "istio-injection" = "enabled"
            } -> null
-           name             = "istio-ingress" -> null
-           resource_version = "39218" -> null
-           uid              = "b173c29d-acf1-4f1c-8c6a-fe3df23eb034" -> null
        }
    }

  # kubernetes_namespace.istio-system will be destroyed
  # (because kubernetes_namespace.istio-system is not in configuration)
-   resource "kubernetes_namespace" "istio-system" {
-       id = "istio-system" -> null

-       metadata {
-           annotations      = {} -> null
-           generation       = 0 -> null
-           labels           = {} -> null
-           name             = "istio-system" -> null
-           resource_version = "118919" -> null
-           uid              = "c3210fb6-f7f2-4b0a-8f6e-5eaf5942b378" -> null
        }
    }

  # module.asm.kubernetes_config_map.asm_options will be created
+   resource "kubernetes_config_map" "asm_options" {
+       data = {
+           "ASM_OPTS"          = "CNI=on"
+           "multicluster_mode" = "manual"
        }
+       id   = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "asm-options"
+           namespace        = "istio-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.asm.kubernetes_namespace.system will be created
+   resource "kubernetes_namespace" "system" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "istio-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.run_command[0] will be created
+   resource "null_resource" "run_command" {
+       id       = (known after apply)
+       triggers = {
+           "arguments"             = "20da2117d1f42ce983e8b180ec9b17e0"
+           "create_cmd_body"       = "cinema us-central1 wayofthesys-cinema false false .terraform/modules/asm/modules/asm/scripts/create_cpr.sh asm-managed regular true false"
+           "create_cmd_entrypoint" = ".terraform/modules/asm.cpr/modules/kubectl-wrapper/scripts/kubectl_wrapper.sh"
+           "gcloud_bin_abs_path"   = "/google-cloud-sdk/bin"
+           "md5"                   = "a65cfbc45ca76efed4d2aa587cee9dc6"
        }
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.run_destroy_command[0] will be created
+   resource "null_resource" "run_destroy_command" {
+       id       = (known after apply)
+       triggers = {
+           "destroy_cmd_body"       = "cinema us-central1 wayofthesys-cinema false false .terraform/modules/asm/modules/asm/scripts/destroy_cpr.sh asm-managed"
+           "destroy_cmd_entrypoint" = ".terraform/modules/asm.cpr/modules/kubectl-wrapper/scripts/kubectl_wrapper.sh"
+           "gcloud_bin_abs_path"    = "/google-cloud-sdk/bin"
        }
    }

Plan: 4 to add, 1 to change, 5 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
